Repository: SKR7lex/winC2D
Catalog: Strings.*.resx
Languages: ja, ko_kr, pt_br, ru, zh_cn, zh_hant

# Msg.ScanSoftwareFailedFmt
source: Failed to scan software: {0}
ja: ソフトウェアのスキャンに失敗しました: {0}
ko_kr: 소프트웨어 스캔 실패: {0}
pt_br: Falha ao escanear software: {0}
ru: Не удалось просканировать ПО: {0}
zh_cn: 扫描软件失败：{0}
zh_hant: 掃描軟體失敗：{0}

# Title.Tip
source: Info
ja: 情報
ko_kr: 정보
pt_br: Informação
ru: Информация
zh_cn: 提示
zh_hant: 提示

# Title.Error
source: Error
ja: エラー
ko_kr: 오류
pt_br: Erro
ru: Ошибка
zh_cn: 错误
zh_hant: 錯誤

# Msg.MigrateFailedFmt
source: Migration failed: {0} {1}
ja: 移行に失敗しました: {0} {1}
ko_kr: 마이그레이션 실패: {0} {1}
pt_br: Falha na migração: {0} {1}
ru: Ошибка миграции: {0} {1}
zh_cn: 迁移失败：{0} {1}
zh_hant: 遷移失敗：{0} {1}

# Msg.MigrateCompleted
source: Migration complete! Success: {0}, Fail: {1}
ja: 移行が完了しました！ 成功: {0}、失敗: {1}
ko_kr: 마이그레이션 완료! 성공: {0}, 실패: {1}
pt_br: Migração concluída! Sucesso: {0}, Falha: {1}
ru: Миграция завершена! Успешно: {0}, Ошибок: {1}
zh_cn: 迁移完成！成功：{0}，失败：{1}
zh_hant: 遷移完成！成功：{0}，失敗：{1}

# Msg.SelectSoftware
source: Please select software to migrate.
ja: 移行するソフトウェアを選択してください。
ko_kr: 마이그레이션할 소프트웨어를 선택하세요.
pt_br: Por favor, selecione o software para migrar.
ru: Пожалуйста, выберите программы для миграции.
zh_cn: 请选择要迁移的软件。
zh_hant: 請選擇要遷移的軟體。

# Desc.TargetFolderForSoftware
source: Select target folder (e.g., D:\Program Files)
ja: ターゲットフォルダを選択（例: D:\Program Files）
ko_kr: 대상 폴더 선택 (예: D:\Program Files)
pt_br: Selecione a pasta de destino (ex: D:\Program Files)
ru: Выберите целевую папку (например, D:\Program Files)
zh_cn: 选择目标文件夹（例如：D:\Program Files）
zh_hant: 選擇目標資料夾（例如：D:\Program Files）

# Menu.Log
source: Migration Log
ja: 移行ログ
ko_kr: 마이그레이션 로그
pt_br: Log de Migração
ru: Журнал миграции
zh_cn: 迁移日志
zh_hant: 遷移日誌

# Menu.Language
source: Language
ja: 言語
ko_kr: 언어
pt_br: Idioma
ru: Язык
zh_cn: 语言
zh_hant: 語言

# Tab.SoftwareMigration
source: Software Migration
ja: ソフトウェア移行
ko_kr: 소프트웨어 마이그레이션
pt_br: Migração de Software
ru: Миграция ПО
zh_cn: 软件迁移
zh_hant: 軟體遷移

# Msg.SelectAppData
source: Please select AppData folders to migrate.
ja: 移行するAppDataフォルダを選択してください。
ko_kr: 마이그레이션할 AppData 폴더를 선택하세요.
pt_br: Por favor, selecione as pastas AppData para migrar.
ru: Пожалуйста, выберите папки AppData для миграции.
zh_cn: 请选择要迁移的 AppData 文件夹。
zh_hant: 請選擇要遷移的 AppData 資料夾。

# Desc.TargetFolderForAppData
source: Select target folder (using mklink symbolic link)
ja: ターゲットフォルダを選択（mklinkシンボリックリンクを使用）
ko_kr: 대상 폴더 선택 (mklink 심볼릭 링크 사용)
pt_br: Selecione a pasta de destino (usando link simbólico mklink)
ru: Выберите целевую папку (используется mklink для символьных ссылок)
zh_cn: 选择目标文件夹（使用 mklink 符号链接）
zh_hant: 選擇目標資料夾（使用 mklink 符號連結）

# Msg.MklinkNote
source: ℹ Note: This operation uses mklink to create symbolic links.
ja: ℹ 注意: この操作はmklinkを使用してシンボリックリンクを作成します。
ko_kr: ℹ 참고: 이 작업은 mklink를 사용하여 심볼릭 링크를 생성합니다.
pt_br: ℹ Observação: Esta operação usa mklink para criar links simbólicos.
ru: ℹ Примечание: Эта операция использует mklink для создания символьных ссылок.
zh_cn: ℹ 注意：此操作使用 mklink 创建符号链接。
zh_hant: ℹ 注意：此操作使用 mklink 建立符號連結。

# Button.RefreshAppData
source: Refresh List
ja: リストを更新
ko_kr: 목록 새로 고침
pt_br: Atualizar Lista
ru: Обновить список
zh_cn: 刷新列表
zh_hant: 重新整理清單

# Settings.Title
source: Settings
ja: 設定
ko_kr: 설정
pt_br: Configurações
ru: Настройки
zh_cn: 设置
zh_hant: 設定

# Settings.ProgramFilesPath
source: Default Program Files Location (64-bit):
ja: デフォルトのプログラムファイルの場所（64ビット）:
ko_kr: 기본 Program Files 위치 (64비트):
pt_br: Localização padrão do Program Files (64-bit):
ru: Расположение Program Files по умолчанию (64-бит):
zh_cn: 默认程序文件位置（64 位）：
zh_hant: 預設程式檔案位置（64 位元）：

# Settings.ProgramFilesPathX86
source: Default Program Files Location (32-bit):
ja: デフォルトのプログラムファイルの場所（32ビット）:
ko_kr: 기본 Program Files 위치 (32비트):
pt_br: Localização padrão do Program Files (32-bit):
ru: Расположение Program Files по умолчанию (32-бит):
zh_cn: 默认程序文件位置（32 位）：
zh_hant: 預設程式檔案位置（32 位元）：

# Settings.CustomX86Path
source: Customize 32-bit program path
ja: 32ビットプログラムのパスをカスタマイズ
ko_kr: 32비트 프로그램 경로 사용자 지정
pt_br: Personalizar caminho de programas 32-bit
ru: Настроить путь для 32-битных программ
zh_cn: 自定义 32 位程序路径
zh_hant: 自訂 32 位元程式路徑

# Button.Browse
source: Browse
ja: 参照
ko_kr: 찾아보기
pt_br: Procurar
ru: Обзор
zh_cn: 浏览
zh_hant: 瀏覽

# Button.Apply
source: Apply
ja: 適用
ko_kr: 적용
pt_br: Aplicar
ru: Применить
zh_cn: 应用
zh_hant: 套用

# Button.Reset
source: Reset to Default
ja: デフォルトにリセット
ko_kr: 기본값으로 재설정
pt_br: Restaurar Padrão
ru: Сбросить настройки
zh_cn: 恢复默认
zh_hant: 恢復預設

# Msg.InvalidPath
source: Please enter a valid folder path.
ja: 有効なフォルダパスを入力してください。
ko_kr: 유효한 폴더 경로를 입력하세요.
pt_br: Por favor, insira um caminho de pasta válido.
ru: Пожалуйста, введите корректный путь к папке.
zh_cn: 请输入有效的文件夹路径。
zh_hant: 請輸入有效的資料夾路徑。

# Msg.SettingsApplied
source: Settings applied successfully!
ja: 設定が正常に適用されました！
ko_kr: 설정이 성공적으로 적용되었습니다!
pt_br: Configurações aplicadas com sucesso!
ru: Настройки успешно применены!
zh_cn: 设置应用成功！
zh_hant: 設定套用成功！

# Msg.SettingsFailed
source: Failed to apply settings: {0}
ja: 設定の適用に失敗しました: {0}
ko_kr: 설정 적용 실패: {0}
pt_br: Falha ao aplicar configurações: {0}
ru: Не удалось применить настройки: {0}
zh_cn: 应用设置失败：{0}
zh_hant: 套用設定失敗：{0}

# Msg.SelectFolder
source: Select the default Program Files location
ja: デフォルトのProgram Filesの場所を選択
ko_kr: 기본 Program Files 위치 선택
pt_br: Selecione a localização padrão do Program Files
ru: Выберите расположение Program Files по умолчанию
zh_cn: 选择默认 Program Files 位置
zh_hant: 選擇預設 Program Files 位置

# Msg.ResetConfirm
source: Are you sure you want to reset to the default location (C:\Program Files)?
ja: デフォルトの場所（C:\Program Files）にリセットしますか？
ko_kr: 기본 위치(C:\Program Files)로 재설정하시겠습니까?
pt_br: Tem certeza que deseja restaurar a localização padrão (C:\Program Files)?
ru: Вы уверены, что хотите сбросить расположение на значение по умолчанию (C:\Program Files)?
zh_cn: 确定要重置为默认位置（C:\Program Files）吗？
zh_hant: 確定要重置為預設位置（C:\Program Files）嗎？

# Settings.ProgramFilesSection
source: Program Files Location (Traditional Desktop Programs)
ja: プログラムファイルの場所（従来のデスクトッププログラム）
ko_kr: Program Files 위치 (기존 데스크톱 프로그램)
pt_br: Localização do Program Files (Programas de Desktop Tradicionais)
ru: Расположение Program Files (классические приложения)
zh_cn: 程序文件位置（传统桌面程序）
zh_hant: 程式檔案位置（傳統桌面程式）

# Settings.ProgramFilesNote
source: ℹ This setting affects traditional desktop programs installed via installers (.exe, .msi). Most third-party software uses this location.
ja: ℹ この設定は、インストーラー（.exe、.msi）経由でインストールされた従来のデスクトッププログラムに影響します。ほとんどのサードパーティソフトウェアはこの場所を使用します。
ko_kr: ℹ 이 설정은 설치 프로그램(.exe, .msi)을 통해 설치된 기존 데스크톱 프로그램에 영향을 줍니다. 대부분의 타사 소프트웨어가 이 위치를 사용합니다.
pt_br: ℹ Esta configuração afeta programas de desktop tradicionais instalados via instaladores (.exe, .msi). A maioria dos softwares de terceiros usa esta localização.
ru: ℹ Эта настройка влияет на классические приложения, установленные через установщики (.exe, .msi). Большинство стороннего ПО использует это расположение.
zh_cn: ℹ 此设置影响通过安装程序（.exe、.msi）安装的传统桌面程序。大多数第三方软件使用此位置。
zh_hant: ℹ 此設定影響透過安裝程式（.exe、.msi）安裝的傳統桌面程式。大多數第三方軟體使用此位置。

# Settings.StoragePolicySection
source: New Content Save Location (Microsoft Store Apps and User Content)
ja: 新しいコンテンツの保存場所（Microsoft Storeアプリとユーザーコンテンツ）
ko_kr: 새 콘텐츠 저장 위치 (Microsoft Store 앱 및 사용자 콘텐츠)
pt_br: Local de Salvamento de Novo Conteúdo (Apps Microsoft Store e Conteúdo do Usuário)
ru: Расположение для нового контента (приложения Microsoft Store и пользовательский контент)
zh_cn: 新内容保存位置（Microsoft Store 应用和用户内容）
zh_hant: 新內容儲存位置（Microsoft Store 應用和使用者內容）

# Settings.StoragePolicyNote
source: ℹ This setting affects Microsoft Store apps and new user content (documents, photos, etc.). Requires Windows 10 or later.
ja: ℹ この設定は、Microsoft Storeアプリと新しいユーザーコンテンツ（ドキュメント、写真など）に影響します。Windows 10以降が必要です。
ko_kr: ℹ 이 설정은 Microsoft Store 앱 및 새 사용자 콘텐츠(문서, 사진 등)에 영향을 줍니다. Windows 10 이상이 필요합니다.
pt_br: ℹ Esta configuração afeta aplicativos Microsoft Store e novo conteúdo do usuário (documentos, fotos, etc.). Requer Windows 10 ou superior.
ru: ℹ Эта настройка влияет на приложения Microsoft Store и новый пользовательский контент (документы, фото и т.д.). Требуется Windows 10 или новее.
zh_cn: ℹ 此设置影响 Microsoft Store 应用和新用户内容（文档、照片等）。需要 Windows 10 或更高版本。
zh_hant: ℹ 此設定影響 Microsoft Store 應用和新使用者內容（文件、照片等）。需要 Windows 10 或更新版本。

# Button.OpenWindowsStorage
source: Open Windows Settings
ja: Windows設定を開く
ko_kr: Windows 설정 열기
pt_br: Abrir Configurações do Windows
ru: Открыть настройки Windows
zh_cn: 打开 Windows 设置
zh_hant: 開啟 Windows 設定

# GroupBox.SystemSettings
source: System Settings
ja: システム設定
ko_kr: 시스템 설정
pt_br: Configurações do Sistema
ru: Системные настройки
zh_cn: 系统设置
zh_hant: 系統設定

# Log.Title
source: Migration Log
ja: 移行ログ
ko_kr: 마이그레이션 로그
pt_br: Log de Migração
ru: Журнал миграции
zh_cn: 迁移日志
zh_hant: 遷移日誌

# Log.Time
source: Time
ja: 時間
ko_kr: 시간
pt_br: Hora
ru: Время
zh_cn: 时间
zh_hant: 時間

# Log.SoftwareName
source: Software Name
ja: ソフトウェア名
ko_kr: 소프트웨어 이름
pt_br: Nome do Software
ru: Название ПО
zh_cn: 软件名称
zh_hant: 軟體名稱

# Log.OldPath
source: Old Path
ja: 旧パス
ko_kr: 이전 경로
pt_br: Caminho Antigo
ru: Старый путь
zh_cn: 原路径
zh_hant: 原路徑

# Log.NewPath
source: New Path
ja: 新パス
ko_kr: 새 경로
pt_br: Novo Caminho
ru: Новый путь
zh_cn: 新路径
zh_hant: 新路徑

# Log.Status
source: Status
ja: ステータス
ko_kr: 상태
ru: Статус
zh_cn: 状态
zh_hant: 狀態

# Log.Message
source: Message
ja: メッセージ
ko_kr: 메시지
pt_br: Mensagem
ru: Сообщение
zh_cn: 消息
zh_hant: 訊息

# Button.Rollback
source: Rollback Selected
ja: 選択をロールバック
ko_kr: 선택 항목 롤백
pt_br: Reverter Selecionado
ru: Откатить выбранное
zh_cn: 回滚所选
zh_hant: 回復所選

# Msg.SelectLogEntry
source: Please select a migration log entry to rollback.
ja: ロールバックする移行ログエントリを選択してください。
ko_kr: 롤백할 마이그레이션 로그 항목을 선택하세요.
pt_br: Por favor, selecione uma entrada do log para reverter.
ru: Пожалуйста, выберите запись в журнале для отката.
zh_cn: 请选择要回滚的迁移日志条目。
zh_hant: 請選擇要回復的遷移日誌條目。

# Msg.NewPathNotExist
source: The new path does not exist, cannot rollback.
ja: 新しいパスが存在しないため、ロールバックできません。
ko_kr: 새 경로가 존재하지 않아 롤백할 수 없습니다.
pt_br: O novo caminho não existe, não é possível reverter.
ru: Новый путь не существует, откат невозможен.
zh_cn: 新路径不存在，无法回滚。
zh_hant: 新路徑不存在，無法回復。

# Msg.OldPathExists
source: The old path already exists, cannot rollback.
ja: 旧パスが既に存在するため、ロールバックできません。
ko_kr: 이전 경로가 이미 존재하여 롤백할 수 없습니다.
pt_br: O caminho antigo já existe, não é possível reverter.
ru: Старый путь уже существует, откат невозможен.
zh_cn: 原路径已存在，无法回滚。
zh_hant: 原路徑已存在，無法回復。

# Msg.RollbackSuccess
source: Rollback successful!
ja: ロールバックが成功しました！
ko_kr: 롤백 성공!
pt_br: Reversão bem-sucedida!
ru: Откат выполнен успешно!
zh_cn: 回滚成功！
zh_hant: 回復成功！

# Msg.RollbackFailedFmt
source: Rollback failed: {0}
ja: ロールバックに失敗しました: {0}
ko_kr: 롤백 실패: {0}
pt_br: Falha na reversão: {0}
ru: Ошибка отката: {0}
zh_cn: 回滚失败：{0}
zh_hant: 回復失敗：{0}

# Msg.Loading
source: Loading...
ja: 読み込み中...
ko_kr: 로드 중...
pt_br: Carregando...
ru: Загрузка...
zh_cn: 加载中...
zh_hant: 載入中...

# Column.SoftwareName
source: Software Name
ja: ソフトウェア名
ko_kr: 소프트웨어 이름
pt_br: Nome do Software
ru: Название ПО
zh_cn: 软件名称
zh_hant: 軟體名稱

# Column.InstallPath
source: Install Path
ja: インストールパス
ko_kr: 설치 경로
pt_br: Caminho de Instalação
ru: Путь установки
zh_cn: 安装路径
zh_hant: 安裝路徑

# Column.Size
source: Size
ja: サイズ
ko_kr: 크기
pt_br: Tamanho
ru: Размер
zh_cn: 大小
zh_hant: 大小

# Button.MigrateSelected
source: Migrate Selected
ja: 選択した項目を移行
ko_kr: 선택 항목 마이그레이션
pt_br: Migrar Selecionado
ru: Мигрировать выбранное
zh_cn: 迁移所选
zh_hant: 遷移所選

# Column.Status
source: Status
ja: ステータス
ru: Статус
zh_cn: 状态
zh_hant: 狀態

# Status.Directory
source: Directory
ja: ディレクトリ
pt_br: Diretório
ru: Каталог
zh_cn: 目录
zh_hant: 目錄

# Status.Symlink
source: Symbolic Link
ja: シンボリックリンク
pt_br: Link simbólico
ru: Символическая ссылка
zh_cn: 符号链接
zh_hant: 符號連結

# Status.Suspicious
source: Pending Check
ja: 疑わしいディレクトリ
pt_br: Aguardando verificação
ru: Подозрительный каталог
zh_hant: 可疑目錄

# Status.Empty
source: Empty Directory
ja: 空のディレクトリ
pt_br: Diretório vazio
ru: Пустой каталог
zh_hant: 空目錄

# Status.Residual
source: Residual / Uninstall Leftover
ja: アンインストール残留
pt_br: Resíduo / desinstalação
ru: Остатки после удаления
zh_hant: 解除安裝殘留

# Tooltip.SizeUnknown
source: Size not calculated yet, run check to compute.
ja: サイズはまだ計算されていません。チェックして計算します。

# Tooltip.StatusSuspicious
source: Needs manual check to confirm status.
ja: サイズが非常に小さいため、チェックしてさらに判定します。
pt_br: Necessita verificação manual para confirmar o status.

# Menu.CopyName
source: Copy Name
ja: 名前をコピー
pt_br: Copiar nome

# Menu.CopyPath
source: Copy Path
ja: インストールパスをコピー
pt_br: Copiar caminho

# Menu.OpenInExplorer
source: Open in Explorer
ja: エクスプローラーで開く
pt_br: Abrir no Explorer

# Button.CheckSuspicious
source: Check Suspicious
ja: チェック
pt_br: Verificar
ru: Проверить
zh_hant: 檢查

# Button.ManageScanPaths
source: Manage Scan Paths
ja: スキャンパスの管理
pt_br: Gerenciar caminhos de varredura
ru: Настроить пути сканирования
zh_hant: 管理掃描路徑

# Menu.Check
source: Check
ja: チェック
pt_br: Verificar
ru: Проверить
zh_hant: 檢查

# Msg.CheckingSuspicious
source: Checking size and status...
ja: サイズ/状態をチェックしています...
pt_br: Verificando tamanho/estado...
ru: Проверка размера/состояния...
zh_hant: 正在檢查體積狀態...

# Dialog.ScanPaths.Title
source: Scan Paths
ja: スキャンパス
pt_br: Caminhos de varredura
ru: Пути сканирования
zh_hant: 掃描路徑

# Dialog.ScanPaths.Hint
source: Select which paths are scanned for installed software. Default paths cannot be deleted but can be disabled.
ja: スキャンするパスを選択してください。既定のパスは無効化はできますが削除できません。
pt_br: Selecione os caminhos a serem varridos. Caminhos padrão podem ser desativados, mas não removidos.
ru: Выберите пути для сканирования установленных программ. Стандартные пути можно отключить, но нельзя удалить.
zh_hant: 選擇要掃描的軟體路徑，預設路徑可停用但不可刪除。

# Button.AddPath
source: Add Path
ja: パスを追加
pt_br: Adicionar caminho
ru: Добавить путь
zh_hant: 新增路徑

# Button.RemovePath
source: Remove Selected
ja: 選択を削除
pt_br: Remover selecionado
ru: Удалить выбранные
zh_hant: 刪除所選

# Button.Save
source: Save
ja: 保存
pt_br: Salvar
ru: Сохранить
zh_hant: 儲存

# Button.Cancel
source: Cancel
ja: キャンセル
pt_br: Cancelar
ru: Отмена
zh_hant: 取消

# Column.Path
source: Path
ja: パス
pt_br: Caminho
ru: Путь
zh_hant: 路徑

# Column.Removable
source: Removable
ja: 削除可
pt_br: Removível
ru: Можно удалить
zh_hant: 可刪除

# Msg.CannotDeleteDefault
source: Default paths cannot be removed.
ja: 既定のパスは削除できません。
pt_br: Caminhos padrão não podem ser removidos.
ru: Стандартные пути нельзя удалить.
zh_hant: 預設路徑不能刪除。
